In [1]:
import pandas as pd

In [2]:
import random
import datetime

#### Generate Sales Data

In [3]:
df1 = pd.DataFrame()

In [4]:
df1['Date'] = pd.date_range(start='2020-01-01', end='2020-09-30')

In [5]:
df1.shape

(274, 1)

In [6]:
df1['Store_1_Sales'] = [random.randrange(10000, 25000) for x in range(274)]
df1['Store_2_Sales'] = [random.randrange(6000, 35000) for x in range(274)]
df1['Store_3_Sales'] = [random.randrange(8000, 44000) for x in range(274)]
df1['Store_4_Sales'] = [random.randrange(2000, 7000) for x in range(274)]
df1['Store_5_Sales'] = [random.randrange(4000, 25000) for x in range(274)]
df1['Store_6_Sales'] = [random.randrange(6000, 18000) for x in range(274)]
df1['Store_7_Sales'] = [random.randrange(5000, 76000) for x in range(274)]
df1['Store_8_Sales'] = [random.randrange(400, 29000) for x in range(274)]
df1['Store_9_Sales'] = [random.randrange(5000, 45700) for x in range(274)]
df1['Store_10_Sales'] = [random.randrange(500, 42000) for x in range(274)]

#### Generate Store Data

In [7]:
locations = ['Marikina', 'Makati', 'Marikina', 'Muntinlupa', 'Pasig',
             'Pasay', 'Pasig', 'Taguig', 'Quezon City', 'Makati']

In [8]:
df2 = pd.DataFrame()
df2['Store_Name'] = [f'Store_{x}' for x in range(1,11)]
df2['Store_Location'] = locations
df2['Number_of_Employees_per_Shift'] = [3, 5, 6, 3, 4, 5, 4, 7, 4, 4]
df2['Rent_Monthly'] = [1e5, 1.5e5, 0.7e5, 1.1e5, 2.1e5, 1.0e5, 9.7e4, 1.2e5, 1.15e5, 9.2e4]
df2['Utilities'] = [x * random.randrange(5,25)/100 for x in df2['Rent_Monthly']]

In [9]:
df2.head(10)

,Store_Name,Store_Location,Number_of_Employees_per_Shift,Rent_Monthly,Utilities
0,Store_1,Marikina,3,100000.0,22000.0
1,Store_2,Makati,5,150000.0,24000.0
2,Store_3,Marikina,6,70000.0,4900.0
3,Store_4,Muntinlupa,3,110000.0,6600.0
4,Store_5,Pasig,4,210000.0,44100.0
5,Store_6,Pasay,5,100000.0,23000.0
6,Store_7,Pasig,4,97000.0,20370.0
7,Store_8,Taguig,7,120000.0,7200.0
8,Store_9,Quezon City,4,115000.0,6900.0
9,Store_10,Makati,4,92000.0,9200.0

#### Generate Tax Data

In [10]:
df3 = pd.DataFrame()
df3['City'] = ['Marikina', 'Makati', 'Muntinlupa', 'Pasig', 'Taguig', 'Quezon City', 'Caloocan', 'Pasay']
df3['Local_Tax_Rate'] = [0.05, 0.13, 0.03, 0.1, 0.08, 0.09, 0.04, 0.03]

In [11]:
df3

          City  Local_Tax_Rate
0     Marikina            0.05
1       Makati            0.13
2   Muntinlupa            0.03
3        Pasig            0.10
4       Taguig            0.08
5  Quezon City            0.09
6     Caloocan            0.04
7        Pasay            0.03

#### Generate Labor Cost Data

In [12]:
df4 = pd.DataFrame()
df4['Day_of_Week'] = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']
df4['Cost_of_Labor'] = [550, 550, 550, 550, 600, 650, 700]

In [13]:
df4

  Day_of_Week  Cost_of_Labor
0      Monday            550
1     Tuesday            550
2   Wednesday            550
3    Thursday            550
4      Friday            600
5    Saturday            650
6      Sunday            700

#### Generate Shift Data

In [14]:
df5 = pd.DataFrame()
df5['Day_of_Week'] = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']
df5['Store_1_Shifts'] = [random.randrange(1, 3) for x in range(7)]
df5['Store_2_Shifts'] = [random.randrange(1, 3) for x in range(7)]
df5['Store_3_Shifts'] = [random.randrange(1, 3) for x in range(7)]
df5['Store_4_Shifts'] = [random.randrange(1, 2) for x in range(7)]
df5['Store_4_Shifts'] = [random.randrange(1, 2) for x in range(7)]
df5['Store_5_Shifts'] = [random.randrange(1, 4) for x in range(7)]
df5['Store_6_Shifts'] = [random.randrange(1, 4) for x in range(7)]
df5['Store_7_Shifts'] = [random.randrange(1, 3) for x in range(7)]
df5['Store_8_Shifts'] = [random.randrange(1, 2) for x in range(7)]
df5['Store_9_Shifts'] = [1 for x in range(7)]
df5['Store_10_Shifts'] = [random.randrange(1, 4) for x in range(7)]

In [15]:
df5

,Day_of_Week,Store_1_Shifts,Store_2_Shifts,Store_3_Shifts,Store_4_Shifts,Store_5_Shifts,Store_6_Shifts,Store_7_Shifts,Store_8_Shifts,Store_9_Shifts,Store_10_Shifts
0,Monday,2,2,1,1,3,2,1,1,1,2
1,Tuesday,1,1,2,1,1,1,2,1,1,3
2,Wednesday,2,2,2,1,3,1,2,1,1,1
3,Thursday,1,1,2,1,2,2,1,1,1,3
4,Friday,1,2,1,1,2,3,1,1,1,3
5,Saturday,2,1,2,1,1,2,1,1,1,2
6,Sunday,2,2,1,1,2,3,1,1,1,1

#### Export Data

In [17]:
df1.to_csv('store_sales.csv', index=False)

In [18]:
df2.to_csv('store_location.csv', index=False)

In [19]:
df3.to_csv('tax_rate.csv', index=False)

In [20]:
df4.to_csv('labor_cost.csv', index=False)

In [21]:
df5.to_csv('num_shifts.csv', index=False)